import React, { useState } from 'react'
import './OurWorksCard.scss'
import OurWorksPopup from '../OurWorksPopup';

const OurWorksCard = (props) => {
    const [popupActive, setPopupActive] = useState(false);

    return (
        <div>
            <OurWorksPopup active={popupActive} setActive={setPopupActive}>
                {}
                <div className='popup popup__info'>
                    <h3 className='popup__title'>
                        Наша работа #1
                    </h3>

                    <p>Описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание.</p>
                    
                    <p>Описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание.</p>

                    <p>Описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание.</p>

                    <p>Описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание.</p>

                    <p>Описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание описание.</p>

                    <p>*Можно спокойно добавить изображения и любой другой текст, иконки.*</p>
                </div>
            </OurWorksPopup>

            <div className='our-works-card' onClick={() => setPopupActive(true)}>
                <div className="img-wrapper">
                    <img className='our-works-card__img' src={props.img} alt={props.title} />   
                </div>

                <div className='our-works-card__title'>
                    <p>
                        {props.title}
                    </p>
                </div>

                <div className='our-works-card__descr'>
                    <p>
                        {props.descr}
                    </p>
                </div>
            </div>
        </div>
    )
}

export default OurWorksCard